In [ ]:
# We can consider dataframe as a Dictionary in Python in which keys are the columns and values are the rows
# E.g.
# Person = {
#    "first": "[Raze, Reyna, Jett]"   first is the column name and values(list) are the values for the column 
#    "last": "[Breach, Brim, Sova]" 
#   }

In [ ]:
person = {
    "first": ["Tony", "Steve", "Doctor", "Morgan"],
    "last": ["Stark", "Rogers", "Strange", "Stark"],
    "email": ["tonystark@email.com", "steverogers@email.com", "doctorstrange@email.com", "morganstark@email.com"]
}

In [ ]:
person['Email'] # fetching email column from the dataframe

In [1]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(person)

In [ ]:
df

In [ ]:
df['Email'] # df.Email can also be used
# use brackets method to avoid confusion

In [ ]:
type(df['Email']) # it is series dtype i.e it is a list of data or one dimensional array
# dataframe is a two dimensional array or the container for the multiple series

In [ ]:
df[['Last Name', 'Email']] # passing list inside the list to specify columns

In [ ]:
df.columns

In [ ]:
df.iloc[[0,1]] # iloc is integer location which gives rows on the basis on index value
# we can pass column as second arguement in iloc to determine which values to be diplayed
# df.iloc[[0,1], 2]

In [ ]:
df.loc[[0,1], 'Email'] # loc is used to pass indexes with labels
# list of labels can also be passed which needs to be displayed
# E.g ['Email', 'Last Name']

In [ ]:
df.set_index('Email', inplace=True) # this is used to set indexes unique for our conveneince and it also gives unique identifier for the rows
# we can use inplace arguement to change the indexes in the dataframe else the changes won't reflect in dataframe
# df.reset_index(inplace=True) can be used to reset the indexes in the df

In [ ]:
df

In [ ]:
df.index # shows all the indexes

In [ ]:
df.loc['tonystark@email.com', 'Last Name'] # we can use our defined indexes with loc instead of using int values
# Second arguement specifies which value to return

In [ ]:
filt = (df['Last Name'] == 'Stark') # displays the result as t/f

In [ ]:
df[filt] 
# this can also be written as:
# df[df['Last Name'] == 'Stark']
# df.loc[filt, 'Email']

In [ ]:
filt = (df['Last Name'] == 'Stark') & (df['First Name'] == 'Tony')

In [ ]:
df[filt]

In [ ]:
filt = (df['Last Name'] != 'Stark') | (df['First Name'] == 'Steve')

In [ ]:
df[filt]

In [ ]:
# df.columns = ['first', 'last', 'email'] allows us to to change names of the columns

In [ ]:
df.columns = ['First Name', 'Last Name']

In [ ]:
df.columns = [x.upper() for x in df.columns] # used to capitalise column namesdf.columns

In [ ]:
df

In [ ]:
df.columns = df.columns.str.replace(' ', '_') # used to replace space with underscores in column names

In [ ]:
df

In [ ]:
df.rename(columns={'FIRST_NAME': 'first', 'LAST_NAME': 'last'}, inplace=True)

In [ ]:
df

In [ ]:
df.loc['steverogers@email.com'] = ['Stephen', 'strange']

In [ ]:
df

In [ ]:
df.loc['doctorstrange@email.com', ['last']] = ['Weird']

In [ ]:
df

In [ ]:
# df.at can also be used for loc

In [ ]:
filt = (df['last'] == 'Weird')

In [ ]:
df.loc[filt, 'first'] = 'Scott'

In [ ]:
df

In [ ]:
# df['email'] = df['email'].str.lower() is used to lower all the values of the column

In [ ]:
df['first'].apply(len) # apply is used to apply methods to all the vlaues of a column

In [ ]:
def update_first(first):
    return first.upper()

In [ ]:
df['first'].apply(update_first) # dont pass the func with () as it will execute the func there itself

In [ ]:
df

In [ ]:
df['first'] = df['first'].apply(update_first)

In [ ]:
df['first'] = df['first'].apply(lambda x: x.lower())
#lambda is an anonymous func which is used as in the arguements are passed and operations are performed on these arguements

In [ ]:
df

In [ ]:
df.apply(len) # len func is applied to the series which tells the length of the series
#len(df['email'])

In [ ]:
df.apply(len, axis='columns') # counting vertically

In [ ]:
df.apply(pd.Series.min) # returns min value
# df.apply(lambda x: x.min())

In [ ]:
df.applymap(len) # applies len to every individial value
# any method passed inside applymap is apllied on every value in dataframe

In [ ]:
# df['first'].map can be used to change values in a column
# simililarly df.replace can also be used

In [ ]:
df['full_name'] = df['first'] + " " + df['last'] # adding two columns

In [ ]:
df

In [ ]:
df.drop(columns=['first', 'last'], inplace=True) # removing columns

In [ ]:
df

In [ ]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True) #splitting full_name into two colummns

In [ ]:
df

In [ ]:
df.drop(columns='full_name', inplace=True)

In [ ]:
df

In [ ]:
df.append({'first': 'Peter', 'last': 'Parker'}, ignore_index=True) # appending a row

In [ ]:
df

In [ ]:
person = {
    "first": ["Peter", "Bucky"],
    "last": ["Parker", "Barns"],
    "email": ["peter@email.com", "bucky@email.com"]
}

In [ ]:
df2 = pd.DataFrame(person)

In [ ]:
df2

In [ ]:
df = df.append(df2, ignore_index=True) # appending dataframe2 to our first dataframe and using ignore_index so as there are no conflicts in the indexes

In [ ]:
df

In [ ]:
df.drop(index=3, inplace=True)

In [ ]:
filt = (df['last'] == 'Barns')

In [ ]:
df.drop(index=df[filt].index) # using filter to remove row
# .index method is used to find the index for the filter

In [ ]:
df.sort_values(by='last') #sorting the data based on last name
#arguements can be used to sort in descending order

In [ ]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True) # sorting on the basis of two columns
# this will sort last name in descending order and first name in ascending order if same last names are there

In [ ]:
df

In [ ]:
df.sort_index()

In [ ]:
df['last'].sort_values() # sorting series

In [8]:
people = {
    'first': ['Tony', 'Peter', 'Steve', 'Chris', np.nan, None, 'NA'],
    'last': ['Stark', 'Parker', 'Rogers', 'Evans', np.nan, np.nan, 'Missing'],
    'email': ['ts@email.com', 'pp@email.com', 'ce@email.com', None, np.nan, np.nan, None],
    'age': ['33', '26','42', '56', np.nan, np.nan, None]
}
# nan is not-a-number

In [21]:
df2 = pd.DataFrame(people)

df2.replace('NA', np.nan, inplace=True)
df2.replace('Missing', np.nan, inplace=True)

In [22]:
df2

   first    last         email   age
0   Tony   Stark  ts@email.com    33
1  Peter  Parker  pp@email.com    26
2  Steve  Rogers  ce@email.com    42
3  Chris   Evans          None    56
4    NaN     NaN           NaN   NaN
5   None     NaN           NaN   NaN
6    NaN     NaN          None  None

In [11]:
df2.dropna()

   first    last         email age
0   Tony   Stark  ts@email.com  33
1  Peter  Parker  pp@email.com  26
2  Steve  Rogers  ce@email.com  42

In [13]:
df2.dropna(axis='index', how='any')
# dropping rows with any missing values

   first    last         email age
0   Tony   Stark  ts@email.com  33
1  Peter  Parker  pp@email.com  26
2  Steve  Rogers  ce@email.com  42

In [14]:
df2.dropna(axis='index', how='all')
# this drop the row if all the values are NA

   first     last         email   age
0   Tony    Stark  ts@email.com    33
1  Peter   Parker  pp@email.com    26
2  Steve   Rogers  ce@email.com    42
3  Chris    Evans          None    56
6     NA  Missing          None  None

In [15]:
df2.dropna(axis='columns', how='all')

   first     last         email   age
0   Tony    Stark  ts@email.com    33
1  Peter   Parker  pp@email.com    26
2  Steve   Rogers  ce@email.com    42
3  Chris    Evans          None    56
4    NaN      NaN           NaN   NaN
5   None      NaN           NaN   NaN
6     NA  Missing          None  None

In [23]:
df2.dropna(axis='index', how='all', subset=['last', 'email'])

   first    last         email age
0   Tony   Stark  ts@email.com  33
1  Peter  Parker  pp@email.com  26
2  Steve  Rogers  ce@email.com  42
3  Chris   Evans          None  56

In [24]:
df2.fillna('Missing') # Filling all NaN values with Missing

     first     last         email      age
0     Tony    Stark  ts@email.com       33
1    Peter   Parker  pp@email.com       26
2    Steve   Rogers  ce@email.com       42
3    Chris    Evans       Missing       56
4  Missing  Missing       Missing  Missing
5  Missing  Missing       Missing  Missing
6  Missing  Missing       Missing  Missing

In [26]:
df2['age'] = df2['age'].astype(float)

In [28]:
df2.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [29]:
df2['age'].mean()

39.25

In [30]:
df2

   first    last         email   age
0   Tony   Stark  ts@email.com  33.0
1  Peter  Parker  pp@email.com  26.0
2  Steve  Rogers  ce@email.com  42.0
3  Chris   Evans          None  56.0
4    NaN     NaN           NaN   NaN
5   None     NaN           NaN   NaN
6    NaN     NaN          None   NaN